In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
np.random.seed(101)

In [15]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [16]:
df

          W         X         Y         Z
A  0.390528  0.146639  1.269122  0.307881
B -0.606806  0.919318 -1.196118  0.508945
C -0.848440  2.010793 -0.137610 -0.598269
D  0.028234  0.392746 -1.441695  0.000323
E -1.049912 -0.229937 -1.283599 -2.711192

In [17]:
df['W']

A    0.390528
B   -0.606806
C   -0.848440
D    0.028234
E   -1.049912
Name: W, dtype: float64

In [18]:
df[['W','Z']]

          W         Z
A  0.390528  0.307881
B -0.606806  0.508945
C -0.848440 -0.598269
D  0.028234  0.000323
E -1.049912 -2.711192

In [22]:
df['new']=df['W']+df['Y']

In [23]:
df

          W         X         Y         Z       new
A  0.390528  0.146639  1.269122  0.307881  1.659650
B -0.606806  0.919318 -1.196118  0.508945 -1.802924
C -0.848440  2.010793 -0.137610 -0.598269 -0.986050
D  0.028234  0.392746 -1.441695  0.000323 -1.413462
E -1.049912 -0.229937 -1.283599 -2.711192 -2.333511

In [26]:
df.drop('new',axis=1)

          W         X         Y         Z
A  0.390528  0.146639  1.269122  0.307881
B -0.606806  0.919318 -1.196118  0.508945
C -0.848440  2.010793 -0.137610 -0.598269
D  0.028234  0.392746 -1.441695  0.000323
E -1.049912 -0.229937 -1.283599 -2.711192

In [27]:
df

          W         X         Y         Z       new
A  0.390528  0.146639  1.269122  0.307881  1.659650
B -0.606806  0.919318 -1.196118  0.508945 -1.802924
C -0.848440  2.010793 -0.137610 -0.598269 -0.986050
D  0.028234  0.392746 -1.441695  0.000323 -1.413462
E -1.049912 -0.229937 -1.283599 -2.711192 -2.333511

In [28]:
df.drop('new',axis=1,inplace=True)

In [29]:
df

          W         X         Y         Z
A  0.390528  0.146639  1.269122  0.307881
B -0.606806  0.919318 -1.196118  0.508945
C -0.848440  2.010793 -0.137610 -0.598269
D  0.028234  0.392746 -1.441695  0.000323
E -1.049912 -0.229937 -1.283599 -2.711192

In [30]:
df.drop('E',axis=0)

          W         X         Y         Z
A  0.390528  0.146639  1.269122  0.307881
B -0.606806  0.919318 -1.196118  0.508945
C -0.848440  2.010793 -0.137610 -0.598269
D  0.028234  0.392746 -1.441695  0.000323

In [32]:
df.shape

(5, 4)

In [33]:
df.loc['A']

W    0.390528
X    0.146639
Y    1.269122
Z    0.307881
Name: A, dtype: float64

In [35]:
df.loc[['A','C']]

          W         X         Y         Z
A  0.390528  0.146639  1.269122  0.307881
C -0.848440  2.010793 -0.137610 -0.598269

In [36]:
df.iloc[0]

W    0.390528
X    0.146639
Y    1.269122
Z    0.307881
Name: A, dtype: float64

In [37]:
df.iloc[[0,2]]

          W         X         Y         Z
A  0.390528  0.146639  1.269122  0.307881
C -0.848440  2.010793 -0.137610 -0.598269

In [39]:
df.loc['A','Y']

1.2691217815776354

In [40]:
df.iloc[2:,:3]

          W         X         Y
C -0.848440  2.010793 -0.137610
D  0.028234  0.392746 -1.441695
E -1.049912 -0.229937 -1.283599